{
    "absolute_url": "https://job-boards.greenhouse.io/greenhouse/jobs/7454336?gh_jid=7454336",
    "data_compliance": [
        {
            "type": "gdpr",
            "requires_consent": false,
            "requires_processing_consent": false,
            "requires_retention_consent": false,
            "retention_period": null,
            "demographic_data_consent_applies": false
        }
    ],
    "internal_job_id": 3313204,
    "location": {
        "name": "Anywhere in the United States"
    },
    "metadata": null,
    "id": 7454336,
    "updated_at": "2025-12-23T12:51:05-05:00",
    "requisition_id": "2025 - P1902",
    "title": "Customer Success Manager II, Mid-Market",
    "pay_input_ranges": [],
    "company_name": "Greenhouse",
    "first_published": "2025-12-22T10:33:13-05:00",
    "language": "en",
    "content": "\u0026lt;div class=\u0026quot;content-intro\u0026quot;\u0026gt;\u0026lt;p\u0026gt;Our \u0026lt;a href=\u0026quot;https://www.greenhouse.com/mission\u0026quot; target=\u0026quot;_blank\u0026quot;\u0026gt;mission\u0026lt;/a\u0026gt; at Greenhouse is to make every company great at hiring – so we go to great lengths to hire great people because we believe that they’re the foundation of our success. At Greenhouse, you’ll join a team that collaborates purposefully, fosters inclusivity, and communicates with transparency and accountability so we can help companies measurably improve the way they hire.\u0026amp;nbsp;\u0026lt;/p\u0026gt;\n\u0026lt;p\u0026gt;Join us to do the best work of your career, solving meaningful problems with remarkable teams.\u0026lt;/p\u0026gt;\u0026lt;/div\u0026gt;\u0026lt;p\u0026gt;Greenhouse is looking for a \u0026lt;strong\u0026gt;Customer Success Manager \u0026lt;/strong\u0026gt;to join our team!\u0026amp;nbsp;\u0026lt;/p\u0026gt;\n\u0026lt;p\u0026gt;Hiring well means engaging all parts of the business and leading organizational change. With this in mind, our Customer Success Managers guide our customers to drive the success of their organizations by transforming the way they hire. Customer Success at Greenhouse isn’t just about relationship management - it’s also about digging into each customer’s goals to help them discover how to best use Greenhouse to drive and improve their hiring strategy.\u0026amp;nbsp;\u0026lt;/p\u0026gt;\n\u0026lt;p\u0026gt;\u0026lt;strong\u0026gt;Who will love this job:\u0026amp;nbsp;\u0026lt;/strong\u0026gt;\u0026lt;/p\u0026gt;\n\u0026lt;ul\u0026gt;\n\u0026lt;li\u0026gt;\u0026lt;strong\u0026gt;A proud advocate, \u0026lt;/strong\u0026gt;you will be the voice of our customers, while remaining, compassionate, responsive, inventive, and effective\u0026amp;nbsp;\u0026lt;/li\u0026gt;\n\u0026lt;li\u0026gt;\u0026lt;strong\u0026gt;A teacher\u0026lt;/strong\u0026gt;, you will help customers learn and navigate the product and inspire confidence on the way to hiring enlightenment\u0026amp;nbsp;\u0026lt;/li\u0026gt;\n\u0026lt;li\u0026gt;\u0026lt;strong\u0026gt;A helper, \u0026lt;/strong\u0026gt;you can easily smooth bumpy roads and have a knack for winning hearts and minds\u0026amp;nbsp;\u0026lt;/li\u0026gt;\n\u0026lt;li\u0026gt;\u0026lt;strong\u0026gt;A trusted subject matter specialist, \u0026lt;/strong\u0026gt;you will learn the ins-and-outs of our product and are creative and inventive in finding solutions for our customers\u0026amp;nbsp;\u0026lt;/li\u0026gt;\n\u0026lt;li\u0026gt;\u0026lt;strong\u0026gt;An excellent teammate\u0026lt;/strong\u0026gt;, you are not only focused on detail, but can see the “big picture” and provide ideas to elevate the team and our processes\u0026amp;nbsp;\u0026lt;/li\u0026gt;\n\u0026lt;/ul\u0026gt;\n\u0026lt;p\u0026gt;\u0026lt;strong\u0026gt;What you’ll do:\u0026amp;nbsp;\u0026lt;/strong\u0026gt;\u0026lt;/p\u0026gt;\n\u0026lt;ul\u0026gt;\n\u0026lt;li\u0026gt;Own and manage customer relationships to showcase the value of Greenhouse and ensure customer happiness and engagement\u0026amp;nbsp;\u0026lt;/li\u0026gt;\n\u0026lt;li\u0026gt;Demonstrate knowledge of products, services, and methodologies to enthusiastically provide support and mentorship\u0026amp;nbsp;\u0026lt;/li\u0026gt;\n\u0026lt;li\u0026gt;Serve as a trusted advisor, advocating internally for customer needs and feature requests to Greenhouse’s internal Support, Product, Engineering, and Sales teams\u0026amp;nbsp;\u0026lt;/li\u0026gt;\n\u0026lt;li\u0026gt;Partner with the Account Management team throughout the customer lifecycle to prevent churn and ensure renewals\u0026amp;nbsp;\u0026lt;/li\u0026gt;\n\u0026lt;li\u0026gt;Team up with our Implementation Strategists through customer onboarding (configuration, data migration, etc.) to ensure the successful launch of new Greenhouse customers\u0026amp;nbsp;\u0026lt;/li\u0026gt;\n\u0026lt;li\u0026gt;Collaborate with high-profile and fast-growing companies to revolutionize their hiring processes\u0026lt;/li\u0026gt;\n\u0026lt;li\u0026gt;Additional projects and responsibilities as business needs require\u0026lt;/li\u0026gt;\n\u0026lt;/ul\u0026gt;\n\u0026lt;p\u0026gt;\u0026lt;strong\u0026gt;You should have:\u0026amp;nbsp;\u0026lt;/strong\u0026gt;\u0026lt;/p\u0026gt;\n\u0026lt;ul\u0026gt;\n\u0026lt;li\u0026gt;2-4 years of hands-on account management or customer success management in the tech industry\u0026amp;nbsp;\u0026lt;/li\u0026gt;\n\u0026lt;li\u0026gt;Strong written communication skills\u0026amp;nbsp;\u0026lt;/li\u0026gt;\n\u0026lt;li\u0026gt;Strong verbal presentation skills\u0026amp;nbsp;\u0026lt;/li\u0026gt;\n\u0026lt;li\u0026gt;Ability to handle conflicting priorities\u0026amp;nbsp;\u0026lt;/li\u0026gt;\n\u0026lt;li\u0026gt;Your own unique talents! Your background has given you a unique perspective and set of transferable skills that aren\u0026#39;t always in alignment with a given role - but those are qualities we value at Greenhouse. If you don\u0026#39;t meet 100% of the qualifications outlined above, we still strongly encourage you to apply\u0026lt;/li\u0026gt;\n\u0026lt;/ul\u0026gt;\n\u0026lt;p\u0026gt;\u0026lt;em\u0026gt;\u0026lt;span style=\u0026quot;font-weight: 400;\u0026quot;\u0026gt;Applicants must be currently authorized to work in the United States on a full-time basis.\u0026lt;/span\u0026gt;\u0026lt;/em\u0026gt;\u0026lt;/p\u0026gt;\n\u0026lt;p\u0026gt;\u0026lt;em\u0026gt;\u0026lt;span style=\u0026quot;font-weight: 400;\u0026quot;\u0026gt;If you are based in California, we encourage you to read this important information for California residents linked\u0026lt;/span\u0026gt;\u0026lt;/em\u0026gt;\u0026lt;a href=\u0026quot;https://www.greenhouse.io/ccpa-candidate\u0026quot;\u0026gt; \u0026lt;em\u0026gt;\u0026lt;span style=\u0026quot;font-weight: 400;\u0026quot;\u0026gt;here\u0026lt;/span\u0026gt;\u0026lt;/em\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;em\u0026gt;\u0026lt;span style=\u0026quot;font-weight: 400;\u0026quot;\u0026gt;.\u0026lt;/span\u0026gt;\u0026lt;/em\u0026gt;\u0026lt;/p\u0026gt;\n\u0026lt;p\u0026gt;\u0026lt;em\u0026gt;\u0026lt;span style=\u0026quot;font-weight: 400;\u0026quot;\u0026gt;The national pay range for this role is \u0026lt;strong\u0026gt;$72,200.00 - $90,000.00 base pay\u0026lt;/strong\u0026gt;. Individual compensation will be commensurate with the candidate\u0026#39;s experience and qualifications. Certain roles may be eligible for additional compensation, including stock option awards, bonuses, and merit increases. Additionally, certain roles have the opportunity to receive sales commissions that are based on the terms of the sales commission plan applicable to the role.\u0026lt;/span\u0026gt;\u0026lt;/em\u0026gt;\u0026lt;/p\u0026gt;\n\u0026lt;p\u0026gt;Greenhouse provides a variety of benefits to employees, including medical, dental, and vision insurance, basic life insurance, mental health resources, financial wellness benefits, and a fully paid parental leave program. For US-based employees, we offer short-term and long-term disability coverage, a 401(k) plan and company match. U.S. based employees also receive, per calendar year, up to 14 scheduled paid holidays and up to 80 hours of paid sick leave. Non-exempt employees accrue up to 20-25 days of paid vacation time annually, depending on tenure, and exempt employees have flexible paid time off (PTO).\u0026lt;/p\u0026gt;\n\u0026lt;p\u0026gt;The anticipated closing date for this role is \u0026lt;strong\u0026gt;Sunday, December 28, 2025\u0026lt;/strong\u0026gt;.\u0026amp;nbsp;\u0026lt;/p\u0026gt;\u0026lt;div class=\u0026quot;content-conclusion\u0026quot;\u0026gt;\u0026lt;h2\u0026gt;\u0026lt;strong\u0026gt;Who we are\u0026lt;/strong\u0026gt;\u0026lt;/h2\u0026gt;\n\u0026lt;p\u0026gt;At Greenhouse, we live by our mission through \u0026lt;a href=\u0026quot;https://www.greenhouse.com/interviewing-at-greenhouse\u0026quot; target=\u0026quot;_blank\u0026quot;\u0026gt;using our own product\u0026lt;/a\u0026gt; to help us hire the right person for the job, every time. We are a remote-first company and have shared office spaces in New York City and Ireland, and optional co-working spaces that give us flexibility to do our best work anywhere. We take an active role in our growth through a performance review program that’s committed to providing actionable feedback, and a bonus structure that rewards great performance. We believe that bringing together a variety of perspectives makes us a stronger company – and we nurture leaders who create an inclusive culture and invest into employee resource groups that celebrate our differences and life experiences. We’re proud to have built an \u0026lt;a href=\u0026quot;https://www.greenhouse.com/awards\u0026quot; target=\u0026quot;_blank\u0026quot;\u0026gt;award-winning culture\u0026lt;/a\u0026gt; that’s been recognized as Fortune’s Best Places to Work and Inc.’s Best Workplaces multiple years in a row.\u0026amp;nbsp;\u0026lt;/p\u0026gt;\n\u0026lt;p\u0026gt;–\u0026amp;nbsp;\u0026lt;/p\u0026gt;\n\u0026lt;p\u0026gt;\u0026lt;em\u0026gt;Greenhouse Software is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy, sexual orientation, or gender identity), national origin, age, disability, genetic information, veteran status, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation during the application process, reach out to accommodations@greenhouse.io.\u0026lt;/em\u0026gt;\u0026lt;/p\u0026gt;\n\u0026lt;p\u0026gt;\u0026lt;em\u0026gt;Emails about job opportunities at Greenhouse Software are only offered by employees with @greenhouse.io email addresses. See \u0026lt;/em\u0026gt;\u0026lt;a href=\u0026quot;https://www.greenhouse.com/candidate-phishing-scams\u0026quot; target=\u0026quot;_blank\u0026quot;\u0026gt;\u0026lt;em\u0026gt;this page\u0026lt;/em\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;em\u0026gt; on our website if you suspect a phishing scam.\u0026lt;/em\u0026gt;\u0026lt;/p\u0026gt;\u0026lt;/div\u0026gt;",
    "departments": [
        {
            "id": 228800,
            "name": "Customer Success ",
            "child_ids": [
                229091,
                229122
            ],
            "parent_id": null
        }
    ],
    "offices": [
        {
            "id": 61603,
            "name": "United States of America",
            "location": null,
            "child_ids": [],
            "parent_id": null
        }
    ]
}